[
    {
        "id": 0,
        "description": "Hello King Midas, I'm having trouble choosing between opening a checking or a savings account. Do checking accounts usually earn a higher interest rate than a savings account?",
        "accept": {
            "gold": 0,
            "people": 0,
            "happiness": -1
            },
        "reject": {
            "gold": 0,
            "people": 0,
            "happiness": 1
            },
        "answer": 0
    },
    {
        "id": 0,
        "description": "King! So many of my friends have opened up credit cards, and I don't understand why they're playing around with money that's not even theirs like that. My friend said that credit cards can help build your credit history, but I don't buy that. Is this true?",
        "accept": {
            "gold": 0,
            "people": 0,
            "happiness": 1
            },
        "reject": {
            "gold": 0,
            "people": 0,
            "happiness": -1
            },
        "answer": 1
    },
    {
        "id": 0,
        "description": "Hello king, my husband and I are thinking of buying a car, and we are taking out a loan. Are we supposed to take out a mortgage to purchase vehicles?",
        "accept": {
            "gold": 0,
            "people": 0,
            "happiness": -1
            },
        "reject": {
            "gold": 0,
            "people": 0,
            "happiness": 1
            },
        "answer": 0
    },
    {
        "id": 0,
        "description": "My parents keep nagging me about paying off my credit card in time, but I don't understand the point in that if I'm going to pay it off in my own time. They say that late payments can lower your credit score, but is that really true?",
        "accept": {
            "gold": 0,
            "people": 0,
            "happiness": 1
            },
        "reject": {
            "gold": 0,
            "people": 0,
            "happiness": -1
            },
        "answer": 1
    },
    {
        "id": 0,
        "description": "I'm gonna test you on some financial math problems, so I hope you know the answer to this question! If you deposit $1,000 in a savings account with an annual interest rate of 3%, will you earn $30 in interest after one year? (Math problems will earn you gold.)",
        "accept": {
            "gold": 1,
            "people": 0,
            "happiness": 1
            },
        "reject": {
            "gold": -1,
            "people": 0,
            "happiness": -1
            },
        "answer": 1
    },
    {
        "id": 0,
        "description": "I'm gonna test you on some financial math problems, so I hope you know the answer to this question! If your credit limit on a credit card is $5,000, and you've used $2,000 of your available credit. Is your credit utilization 30%? (Math problems will earn you gold.)",
        "accept": {
            "gold": -1,
            "people": 0,
            "happiness": -1
            },
        "reject": {
            "gold": 1,
            "people": 0,
            "happiness": 1
            },
        "answer": 0
    },
    {
        "id": 0,
        "description": "Hi King Midas, I always hear about credit scores, but is it true that your credit score is based on your income and job history?",
        "accept": {
            "gold": 0,
            "people": 0,
            "happiness": -1
            },
        "reject": {
            "gold": 0,
            "people": 0,
            "happiness": 1
            },
        "answer": 0
    },
    {
        "id": 0,
        "description": "I’ve heard that defaulting on a loan can negatively impact your credit score. Is that true?",
        "accept": {
            "gold": 0,
            "people": 0,
            "happiness": 1
            },
        "reject": {
            "gold": 0,
            "people": 0,
            "happiness": -1
            },
        "answer": 1
    },
    {
        "id": 0,
        "description": "My friend and I were thinking about opening a joint account, but she said joint accounts are only available for married couples. Is that really the case, king?",
        "accept": {
            "gold": 0,
            "people": 0,
            "happiness": -1
            },
        "reject": {
            "gold": 0,
            "people": 0,
            "happiness": 1
            },
        "answer": 0
    },
    {
        "id": 0,
        "description": "I'm gonna test you on some financial math problems, so I hope you know the answer to this question! If you invest $2,000 in a Certificate of Deposit (CD) for 2 years at an annual interest rate of 5%, will the total amount in your CD after 2 years be $2500, assuming simple interest? (Math problems will earn you gold.)",
        "accept": {
            "gold": -2,
            "people": 0,
            "happiness": -2
            },
        "reject": {
            "gold": 2,
            "people": 0,
            "happiness": 2
            },
        "answer": 0
    },
    {
        "id": 0,
        "description": "I'm gonna test you on some financial math problems, so I hope you know the answer to this question! If you carry a balance of $500 on your credit card with an annual interest rate of 18%, will you pay $7.50 in interest in one month? Assume the monthly interest rate is 18% ÷ 12. (Math problems will earn you gold.)",
        "accept": {
            "gold": 3,
            "people": 0,
            "happiness": 3
            },
        "reject": {
            "gold": -3,
            "people": 0,
            "happiness": -3
            },
        "answer": 1
    },
    {
        "id": 0,
        "description": "A friend told me that credit scores are only affected by the amount of debt you owe and not your payment history. Is that true?",
        "accept": {
            "gold": 0,
            "people": 0,
            "happiness": -1
            },
        "reject": {
            "gold": 0,
            "people": 0,
            "happiness": 1
            },
        "answer": 0
    },
    {
        "id": 0,
        "description": "King Midas! I’m trying to understand the difference between secured and unsecured loans. Does a secured loan require collateral, while an unsecured loan does not?",
        "accept": {
            "gold": 0,
            "people": 0,
            "happiness": 1
            },
        "reject": {
            "gold": 0,
            "people": 0,
            "happiness": -1
            },
        "answer": 1
    },
    {
        "id": 0,
        "description": "I heard that having a high credit score can help you qualify for loans with better interest rates. Is that true?",
        "accept": {
            "gold": 0,
            "people": 0,
            "happiness": 1
            },
        "reject": {
            "gold": 0,
            "people": 0,
            "happiness": -1
            },
        "answer": 1
    },
    {
        "id": 0,
        "description": "I'm gonna test you on some financial math problems, so I hope you know the answer to this question! You take out a loan for $10,000 at an interest rate of 6% per year for 5 years. Will your monthly payment approximately be $100 for a fixed-rate loan? (Math problems will earn you gold.)",
        "accept": {
            "gold": -5,
            "people": 0,
            "happiness": 5
            },
        "reject": {
            "gold": 5,
            "people": 0,
            "happiness": 5
            },
        "answer": 0
    },
    {
        "id": 0,
        "description": "I'm gonna test you on some financial math problems, so I hope you know the answer to this question! If you take out a loan of $15,000 at an interest rate of 5% for 3 years, will you pay $2,250 in interest by the end of the loan term? Assume simple interest. (Math problems will earn you gold.)",
        "accept": {
            "gold": 5,
            "people": 0,
            "happiness": 5
            },
        "reject": {
            "gold": -5,
            "people": 0,
            "happiness": -5
            },
        "answer": 1
    },
    {
        "id": 0,
        "description": "I was thinking about getting a debit card, but my friend said that it allows you to borrow money from the bank to make purchases. Is that correct?",
        "accept": {
            "gold": 0,
            "people": 0,
            "happiness": -1
            },
        "reject": {
            "gold": 0,
            "people": 0,
            "happiness": 1
            },
        "answer": 0
    },
    {
        "id": 0,
        "description": "I've heard that defaulting on a loan can negatively impact your credit score. Is that true?",
        "accept": {
            "gold": 0,
            "people": 0,
            "happiness": 1
            },
        "reject": {
            "gold": 0,
            "people": 0,
            "happiness": -1
            },
        "answer": 1
    }
]